Revit 2027 API
RebarUpdateCurvesData.StartConstraintLostTargets Property
 Indicates if the start handle constraint lost one or more targets in the last regeneration (i.e. structural was modified in a way that target faces changed or were removed).
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool StartConstraintLostTargets { get; }
Public ReadOnly Property StartConstraintLostTargets As Boolean
	Get
public:
property bool StartConstraintLostTargets {
	bool get ();
}
member StartConstraintLostTargets : bool with get
Property Value
Boolean
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace